app/views/parkings/_parking_ticket_info.erb

<h2>Current time <span id="time" class="data-fix"></span></h2>
<h2>Ticket purchased at: <span class="data-fix"><%= (Parking.last.created_at - 4.hours).strftime('%r') %></span></h2>
<h2> Ticket valid until: <span class="data-fix"><%= ((Parking.last.created_at - 4.hours) + Parking.last.validity.hours).strftime("%r") %></span></h2>
---
INSERT INTO `parkings` (`created_at`, `updated_at`, `license`) VALUES ('2018-08-22 01:15:22', '2018-08-22 01:15:22', 'qwe 2378')
SELECT  `parkings`.* FROM `parkings` ORDER BY `parkings`.`id` DESC LIMIT 1
SELECT  `parkings`.* FROM `parkings` LIMIT 11

    console.log('Ticket valid until <%= ((Parking.last.created_at - 4.hours) + Parking.last.validity.hours).strftime("%b %d, %Y %H:%M:%S") %>');
    var countDownDate = new Date("<%= ((Parking.last.created_at - 4.hours) + Parking.last.validity.hours).strftime("%b %d, %Y %H:%M:%S") %>").getTime();
---
SELECT COUNT(*) FROM `parkings`