app/views/parkings/index.html.erb

<h2>Current time <span class="data-fix"><%= Time.now.strftime("%r") %></span></h2>
<h2> Ticket valid until: <span class="data-fix"><%= ((Parking.last.created_at - 4.hours) + Parking.last.validity.hours).strftime("%r") %></span></h2>
---
SELECT `parkings`.* FROM `parkings`