app/controllers/parkings_controller.rb

SELECT  `parkings`.* FROM `parkings` ORDER BY `parkings`.`id` DESC LIMIT 1
SELECT COUNT(*) FROM `parkings`
---
  def index
    @parkings = Parking.all
    number_of_spots = 7
    unless Parking.last.nil?
      @current_parking_info = Parking.last
      @spots_available = number_of_spots - @parkings.count

SELECT COUNT(*) FROM `parkings`
SELECT  `parkings`.* FROM `parkings` WHERE `parkings`.`id` = 2 LIMIT 1
---
  def show
    # binding.pry
    @occupied_spots = Parking.all.count
    number_of_spots = 7
    @spots_available = number_of_spots - @occupied_spots
    @current_parking_info = Parking.find(params[:id])

INSERT INTO `parkings` (`created_at`, `updated_at`, `license`) VALUES ('2018-08-22 01:15:22', '2018-08-22 01:15:22', 'qwe 2378')
SELECT COUNT(*) FROM `parkings`
SELECT  `parkings`.* FROM `parkings` ORDER BY `parkings`.`id` DESC LIMIT 1
---
  def create
    @parking = Parking.new(parking_params)
    respond_to do |format|
      if @parking.save
        @total_spots = Parking.all.count
        number_of_spots = 7
        @spots_available = number_of_spots - @total_spots
        unless Parking.last.nil?

SELECT `parkings`.* FROM `parkings`
SELECT COUNT(*) FROM `parkings`
SELECT  `parkings`.* FROM `parkings` WHERE `parkings`.`id` = 1 LIMIT 1
UPDATE `parkings` SET `is_void` = 1, `updated_at` = '2018-08-22 12:47:36' WHERE `parkings`.`id` = 1
---
  def pay_ticket
    # binding.pry
    @parkings = Parking.all
    @occupied_spots = Parking.all.count
    number_of_spots = 7
    @spots_available = number_of_spots - @occupied_spots
    @current_parking_info = Parking.find(params[:id])
    @current_parking_info.is_void = true
    @current_parking_info.save

DELETE FROM `parkings` WHERE `parkings`.`id` = 7
SELECT COUNT(*) FROM `parkings`
SELECT  `parkings`.* FROM `parkings` ORDER BY `parkings`.`id` DESC LIMIT 1
---
  def destroy
    @parking.destroy
    @total_cars = Parking.all.count
    number_of_spots = 7
    unless @total_cars.zero?
      @spots_available = number_of_spots - @total_cars
      @current_parking_info = Parking.last

SELECT  `parkings`.* FROM `parkings` WHERE `parkings`.`id` = 29 LIMIT 1
---
  def set_parking
    @parking = Parking.find(params[:id])